In [9]:
dict1={"name":"Maganti Santhosh Kumar"}

In [10]:
dict1

{'name': 'Maganti Santhosh Kumar'}

In [11]:
dict2={"family":("veera brahmmam","ratna kumari","sravanthi","sravani")}

In [12]:
dict2

{'family': ('veera brahmmam', 'ratna kumari', 'sravanthi', 'sravani')}

In [29]:
dict3={"family":("veera brahmmam","ratna kumari","sravanthi","sravani"),"relation":("father","mother","elder sister","younger sister")}

In [30]:
dict3

{'family': ('veera brahmmam', 'ratna kumari', 'sravanthi', 'sravani'),
 'relation': ('father', 'mother', 'elder sister', 'younger sister')}

In [31]:
df_fam=pd.DataFrame(dict3)

In [32]:
df_fam

           family        relation
0  veera brahmmam          father
1    ratna kumari          mother
2       sravanthi    elder sister
3         sravani  younger sister

In [23]:
import pandas
import pandas as pd
df_loc=pd.read_excel(r"E:\Santhosh\mergeconcept.xlsx")
df_loc

       name           location
0  santhosh                NaN
1    parvin           dargaopp
2    anusha  oppambedkarstatue
3  jayasree            pamarru
4   shabana           nidumolu
5  nasheena      patanpetaroad

In [24]:
import pandas as pd
df_food=pd.read_excel(r"E:\Santhosh\mergeconcept.xlsx",sheet_name="Sheet2")
df_food

       name    food
0    parvin     veg
1  nasheena  nonveg
2  jayasree     veg
3    anusha  nonveg
4   shabana     NaN

In [25]:
df_loc.merge(df_food,how="outer",on="name")

       name           location    food
0  santhosh                NaN     NaN
1    parvin           dargaopp     veg
2    anusha  oppambedkarstatue  nonveg
3  jayasree            pamarru     veg
4   shabana           nidumolu     NaN
5  nasheena      patanpetaroad  nonveg

In [26]:
df_loc.merge(df_food,how="inner",on="name")

       name           location    food
0    parvin           dargaopp     veg
1    anusha  oppambedkarstatue  nonveg
2  jayasree            pamarru     veg
3   shabana           nidumolu     NaN
4  nasheena      patanpetaroad  nonveg

In [27]:
df_loc.merge(df_food,how="left",on="name")

       name           location    food
0  santhosh                NaN     NaN
1    parvin           dargaopp     veg
2    anusha  oppambedkarstatue  nonveg
3  jayasree            pamarru     veg
4   shabana           nidumolu     NaN
5  nasheena      patanpetaroad  nonveg

In [28]:
df_loc.merge(df_food,how="right",on="name")

       name           location    food
0    parvin           dargaopp     veg
1  nasheena      patanpetaroad  nonveg
2  jayasree            pamarru     veg
3    anusha  oppambedkarstatue  nonveg
4   shabana           nidumolu     NaN